Infilling element replaced by a later phase insert must be the same type as the insert's host.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId InfillCannotChangeType { get; }
  Visual Basic
Public Shared ReadOnly Property InfillCannotChangeType As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InfillCannotChangeType {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures InfillFailures Class
  Autodesk.Revit.DB Namespace